Revit 2024 API
BuiltInFailures.ScheduleViewFailures.PanelScheduleSwitchboardSlotInconsistency Property
 The template applied to this panel schedule is set to display fewer space than what is needed to display the max number of circuits set on the equipment.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId PanelScheduleSwitchboardSlotInconsistency { get; }
Visual Basic
Public Shared ReadOnly Property PanelScheduleSwitchboardSlotInconsistency As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ PanelScheduleSwitchboardSlotInconsistency {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.ScheduleViewFailures Class
Autodesk.Revit.DB Namespace